#include <string>
#include "Map.hpp"
#include <algorithm>
#include <vector>
#include <iostream>


int main()
{
    setlocale(LC_ALL, "ru");
	
    std::vector<std::pair<size_t, std::string>> passport_data = {
       {5432, "Иванов Иван Иванович"},
       {6543, "Петров Петр Петрович"},
       {7654, "Сидоров Сидор Сидорович"},
       {8765, "Кузнецов Алексей Алексеевич"},
       {9876, "Козлов Владимир Владимирович"},
       {1818, "Новиков Андрей Викторович"},
       {1717, "Михайлов Михаил Михайлович"},
       {1616, "Федоров Александр Владимирович"},
       {1515, "Дмитриев Сергей Анатольевич"},
       {1313, "Борисов Борис Борисович"},
       {1010, "Григорьев Григорий Павлович"},
       {9999, "Смирнов Николай Александрович"},
       {8888, "Егоров Павел Сергеевич"},
       {7777, "Тимофеев Константин Константинович"},
       {6666, "Попов Олег Валентинович"},
       {5555, "Чернов Юрий Иванович"},
       {4444, "Куликов Роман Владимирович"},
       {3333, "Родионов Виталий Сергеевич"},
       {1112, "Шевченко Дмитрий Михайлович"},
       {1231, "Павлов Артем Юрьевич"},
       {1111, "Филиппов Александр Павлович"},
       {3132, "Шестаков Андрей Сергеевич"},
       {1233, "Захаров Кирилл Михайлович"}
    };

    container::Map<int, std::string> m;

    for (auto el : passport_data) {
        m.insert(el);
    }

    m.inorder();
    m.preorder();
    m.postorder();

    int count = 0;
    
    for (int i = 0; i < passport_data.size(); i++) {
        count += m[passport_data[i].first].size();
    }
    
    std::cout << count;

    return 0;
}